In [1]:
import pandas as pd
import numpy as np

In [2]:

df_movies = pd.read_csv('../data/peliculas.csv')

# df_movies = df_movies[df_movies['unknown']==0]
# df_movies = df_movies.drop(columns=['unknown'])

df_users = pd.read_csv('../data/usuarios.csv')

# Users

In [3]:
df_users = pd.read_csv('../data/usuarios.csv')
df_users = df_users.rename(columns={'id':'user_id'})
df_users.head()

   user_id  Occupation         Active Since
0        1  technician  1997-09-22 21:57:58
1        2       other  1998-02-27 03:26:00
2        3      writer  1998-03-07 02:15:39
3        4  technician  1998-04-08 02:09:34
4        5       other  1997-09-30 15:57:44

In [4]:
df_users.Occupation.value_counts()

Occupation
student          193
other            102
educator          94
administrator     77
engineer          67
programmer        65
librarian         51
writer            45
executive         31
scientist         30
artist            27
technician        27
marketing         25
entertainment     17
healthcare        16
ITBA              15
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64

In [5]:
# cantidad de ids en el dataframe
len(df_users['user_id'].unique())

943

In [6]:
df_users['Active Since'].iloc[0]

'1997-09-22 21:57:58'

In [7]:
df_users['Active Since'] = df_users['Active Since'].apply(lambda x: pd.to_datetime(x))
df_users['Active Since'].iloc[0]

Timestamp('1997-09-22 21:57:58')

In [8]:
df_users.head(1)

   user_id  Occupation        Active Since
0        1  technician 1997-09-22 21:57:58

# People

In [9]:
df_people = pd.read_csv('../data/personas.csv')
df_people.head(3)

   id       Full Name  year of birth Gender Zip Code
0   1  Robert Stanley           1974      M    85711
1   2  Heather Bossey           1945      F    94043
2   3       Don Davis           1975      M    32067

In [10]:
df_people = df_people.rename(columns={'id':'user_id'})
df_people['Zip Code'].value_counts()

Zip Code
55414    9
55105    6
55337    5
10003    5
20009    5
        ..
24060    1
55413    1
19149    1
02176    1
77841    1
Name: count, Length: 795, dtype: int64

In [11]:
# Voy a tirar el zip code, porque no tengo tantos datos para entrenar otro embedding mas
df_people = df_people.drop(columns=['Zip Code'])
df_people.describe()

          user_id  year of birth
count  943.000000     943.000000
mean   472.000000    1963.948038
std    272.364951      12.192740
min      1.000000    1925.000000
25%    236.500000    1955.000000
50%    472.000000    1967.000000
75%    707.500000    1973.000000
max    943.000000    1991.000000

In [12]:
df_people.Gender.value_counts()

Gender
M    670
F    273
Name: count, dtype: int64

In [13]:
df_people.head(1)

   user_id       Full Name  year of birth Gender
0        1  Robert Stanley           1974      M

# Workers

In [14]:
df_workers = pd.read_csv('../data/trabajadores.csv')
df_workers = df_workers.rename(columns={'id':'user_id'})

df_workers

    user_id                    Position Category Working Hours  Start Date
0        16                     Analyst        B        9 - 18  1998-03-30
1        31                     Analyst        A        9 - 18  1997-09-25
2       167                     Analyst        B        7 - 16  1997-10-24
3       183                     Analyst        C       20 - 04  1998-01-26
4       298                     Analyst        C        9 - 18  1997-10-18
5       358                     Analyst        A        7 - 16  1998-04-17
6       397                     Analyst        B        7 - 16  1998-02-08
7       470                         CTO        A        7 - 16  1997-12-23
8       501                         CFO        C        7 - 16  1998-01-17
9       598                         CEO        A          8-17  1997-12-06
10      629      Sales Regional Manager        A        9 - 18  1997-11-12
11      665  Marketing Regional Manager        C          8-17  1997-09-22
12      751                  IT Manager        B       20 - 04  1998-01-15
13      803                          IT        C          8-17  1997-11-13
14      872                          IT        C        9 - 18  1997-11-14

In [15]:
# Esta tabla solo la voy a usar para una variable categorica binaria trabaja/no trabaja
df_workers['Start Date'].iloc[0]

'1998-03-30'

In [16]:
df_workers['Start Date'] = df_workers['Start Date'].apply(lambda x: pd.to_datetime(x))
df_workers['Start Date'].iloc[0]

Timestamp('1998-03-30 00:00:00')

In [17]:
df_workers.head(1)

   user_id Position Category Working Hours Start Date
0       16  Analyst        B        9 - 18 1998-03-30

# Merge: users + personas + trabajadores

In [18]:
df_merged =df_people.merge(df_users,how='inner',on='user_id')

df_merged.head(3)

,user_id,Full Name,year of birth,Gender,Occupation,Active Since
0,1,Robert Stanley,1974,M,technician,1997-09-22 21:57:58
1,2,Heather Bossey,1945,F,other,1998-02-27 03:26:00
2,3,Don Davis,1975,M,writer,1998-03-07 02:15:39

In [19]:
df_merged.shape,df_merged.dropna().shape,len(df_merged['user_id'].unique())

((943, 6), (943, 6), 943)

In [20]:
df_workers.head(3)

   user_id Position Category Working Hours Start Date
0       16  Analyst        B        9 - 18 1998-03-30
1       31  Analyst        A        9 - 18 1997-09-25
2      167  Analyst        B        7 - 16 1997-10-24

In [21]:
#Voy a hacer algunos retoques a las columnas antes de continuar

# De la tabla de empleados solo voy a utilizar si trabaja o no trabaja
df_workers = df_workers[['user_id','Category']]
df_workers.head(3)

   user_id Category
0       16        B
1       31        A
2      167        B

In [22]:
# La union es left porque quiero mantener el total de las personas, no solo aquellas empleadas de la plataforma
df_merged =df_merged.merge(df_workers,how='left',on='user_id')
df_merged.loc[df_merged['Category'].notna(),'Category'] = 1
df_merged['Category']=df_merged['Category'].fillna(0)

df_merged.head(3)

C:\Users\jose_\AppData\Local\Temp\ipykernel_9716\22413777.py:4: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_merged['Category']=df_merged['Category'].fillna(0)

,user_id,Full Name,year of birth,Gender,Occupation,Active Since,Category
0,1,Robert Stanley,1974,M,technician,1997-09-22 21:57:58,0
1,2,Heather Bossey,1945,F,other,1998-02-27 03:26:00,0
2,3,Don Davis,1975,M,writer,1998-03-07 02:15:39,0

In [23]:
df_merged['Category'].value_counts()

Category
0    928
1     15
Name: count, dtype: int64

In [24]:
df_merged = df_merged.rename(columns={'Category':'Trabajador'})
df_merged.head(3)

,user_id,Full Name,year of birth,Gender,Occupation,Active Since,Trabajador
0,1,Robert Stanley,1974,M,technician,1997-09-22 21:57:58,0
1,2,Heather Bossey,1945,F,other,1998-02-27 03:26:00,0
2,3,Don Davis,1975,M,writer,1998-03-07 02:15:39,0

In [25]:
df_merged['Active Since'].min(),df_merged['Active Since'].max()

(Timestamp('1997-09-20 03:05:10'), Timestamp('1998-04-22 23:02:29'))

In [26]:
df_merged['Active Since'].max()-df_merged['Active Since'].min()

Timedelta('214 days 19:57:19')

In [27]:
# Active Since lo voy a cambiar por dias de antiguedad, usando la fecha mas antigua
df_merged['Antiguedad'] = (df_merged['Active Since']-df_merged['Active Since'].min()).dt.days

df_merged.head(3)

,user_id,Full Name,year of birth,Gender,Occupation,Active Since,Trabajador,Antiguedad
0,1,Robert Stanley,1974,M,technician,1997-09-22 21:57:58,0,2
1,2,Heather Bossey,1945,F,other,1998-02-27 03:26:00,0,160
2,3,Don Davis,1975,M,writer,1998-03-07 02:15:39,0,167

In [28]:
# Check
df_merged['Antiguedad'].min(),df_merged['Antiguedad'].max()

(0, 214)

In [29]:
# Para ver si las vibras astrales tienen correlacion, me voy a quedar con el mes que activo su cuenta
df_merged['Horoscopo Activacion'] = df_merged['Active Since'].dt.month
df_merged.head(3)

,user_id,Full Name,year of birth,Gender,Occupation,Active Since,Trabajador,Antiguedad,Horoscopo Activacion
0,1,Robert Stanley,1974,M,technician,1997-09-22 21:57:58,0,2,9
1,2,Heather Bossey,1945,F,other,1998-02-27 03:26:00,0,160,2
2,3,Don Davis,1975,M,writer,1998-03-07 02:15:39,0,167,3

In [30]:
# Dropeo finalmente las columnas que no me sirven
# df_merged = df_merged.drop(columns=['Full Name','Active Since'])
# df_merged.head(3)

In [31]:
df_merged.shape

(943, 9)

# Ratings

In [32]:
df_ratings = pd.read_csv('../data/scores.csv')
df_ratings = df_ratings.drop(columns=['Unnamed: 0'])

df_ratings.head(3)

   user_id  movie_id  rating                 Date
0      196       242       3  1997-12-04 15:55:49
1      186       302       3  1998-04-04 19:22:22
2       22       377       1  1997-11-07 07:18:36

In [33]:
# Check NaNs
df_ratings.shape,df_ratings.dropna().shape,len(df_ratings.user_id.unique())

((100000, 4), (100000, 4), 943)

In [34]:
# Check formto fecha
df_ratings['Date'].iloc[0]

'1997-12-04 15:55:49'

In [35]:
df_ratings['Date'] = df_ratings['Date'].apply(lambda x: pd.to_datetime(x))
df_ratings['Date'].iloc[0]

Timestamp('1997-12-04 15:55:49')

In [36]:
df_ratings.head(3)

   user_id  movie_id  rating                Date
0      196       242       3 1997-12-04 15:55:49
1      186       302       3 1998-04-04 19:22:22
2       22       377       1 1997-11-07 07:18:36

# Movies

In [37]:
df_movies = pd.read_csv('../data/peliculas.csv')

df_movies = df_movies.rename(columns={'id':'movie_id'})
df_movies = df_movies.drop(columns=['IMDB URL'])

df_movies['Release Date'] = df_movies['Release Date'].apply(lambda x: pd.to_datetime(x))


df_movies.head(3)

,movie_id,Name,Release Date,unknown,Action,Adventure,Animation,Children's,Comedy,Crime,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),1995-01-01,0,0,0,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),1995-01-01,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),1995-01-01,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [38]:
df_movies.describe()

,movie_id,Release Date,unknown,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
count,1682.000000,1681,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,...,1682.00000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000
mean,841.500000,1989-07-16 12:53:32.373587072,0.001189,0.149227,0.080262,0.024970,0.072533,0.300238,0.064804,0.029727,...,0.01308,0.014269,0.054697,0.033294,0.036266,0.146849,0.060048,0.149227,0.042212,0.016052
min,1.000000,1922-01-01 00:00:00,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,421.250000,1993-01-01 00:00:00,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,841.500000,1995-01-01 00:00:00,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,1261.750000,1996-10-18 00:00:00,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,1682.000000,1998-10-23 00:00:00,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.00000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
std,485.695893,NaN,0.034473,0.356418,0.271779,0.156081,0.259445,0.458498,0.246253,0.169882,...,0.11365,0.118632,0.227455,0.179456,0.187008,0.354061,0.237646,0.356418,0.201131,0.125714

In [39]:
df_movies.shape,df_movies.dropna().shape

((1682, 22), (1681, 22))

In [40]:
# df_movies = df_movies[df_movies['unknown']==0]
# df_movies = df_movies.drop(columns=['unknown'])

In [41]:
df_movies.shape,df_movies.dropna().shape

((1682, 22), (1681, 22))

# Merged scores +movies

In [42]:
df_ratings.head(1)

   user_id  movie_id  rating                Date
0      196       242       3 1997-12-04 15:55:49

In [43]:
df_ratings = df_ratings.rename(columns={'Date':'Date_rating'})

In [44]:
df_movies.head(1)

,movie_id,Name,Release Date,unknown,Action,Adventure,Animation,Children's,Comedy,Crime,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),1995-01-01,0,0,0,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0

In [45]:
df_movies = df_movies.rename(columns={'Name':'Name_movie'})

In [46]:
# Calculo dias de antiguedad de la peli
df_movies['Antiguedad_pelicula'] = (df_movies['Release Date']-df_movies['Release Date'].min()).dt.days

df_movies.head(3)

,movie_id,Name_movie,Release Date,unknown,Action,Adventure,Animation,Children's,Comedy,Crime,...,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western,Antiguedad_pelicula
0,1,Toy Story (1995),1995-01-01,0,0,0,1,1,1,0,...,0,0,0,0,0,0,0,0,0,26663.0
1,2,GoldenEye (1995),1995-01-01,0,1,1,0,0,0,0,...,0,0,0,0,0,0,1,0,0,26663.0
2,3,Four Rooms (1995),1995-01-01,0,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,26663.0

In [47]:
df_movies['Antiguedad_pelicula'].max(),df_movies['Antiguedad_pelicula'].min()

(28054.0, 0.0)

In [48]:
# Hago el merge
df_merged_pelis = df_ratings.merge(df_movies,on='movie_id')

df_merged_pelis.head(3)

,user_id,movie_id,rating,Date_rating,Name_movie,Release Date,unknown,Action,Adventure,Animation,...,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western,Antiguedad_pelicula
0,196,242,3,1997-12-04 15:55:49,Kolya (1996),1997-01-24,0,0,0,0,...,0,0,0,0,0,0,0,0,0,27417.0
1,186,302,3,1998-04-04 19:22:22,L.A. Confidential (1997),1997-01-01,0,0,0,0,...,1,0,0,1,0,0,1,0,0,27394.0
2,22,377,1,1997-11-07 07:18:36,Heavyweights (1994),1994-01-01,0,0,0,0,...,0,0,0,0,0,0,0,0,0,26298.0

In [49]:
df_merged_pelis.shape,df_merged_pelis.dropna().shape

((100000, 26), (99991, 26))

# Merge Final

In [50]:
df_merged.shape,df_merged_pelis.shape

((943, 9), (100000, 26))

In [51]:
df_full = df_merged.merge(df_merged_pelis)
df_full.shape

(100000, 34)

In [52]:
df_full.head(1)

,user_id,Full Name,year of birth,Gender,Occupation,Active Since,Trabajador,Antiguedad,Horoscopo Activacion,movie_id,...,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western,Antiguedad_pelicula
0,1,Robert Stanley,1974,M,technician,1997-09-22 21:57:58,0,2,9,61,...,0,0,0,0,0,0,0,0,0,26298.0

In [53]:
df_full.describe()

,user_id,year of birth,Active Since,Trabajador,Antiguedad,Horoscopo Activacion,movie_id,rating,Date_rating,Release Date,...,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western,Antiguedad_pelicula
count,100000.00000,100000.000000,100000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000,99991,...,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.00000,100000.00000,100000.000000,100000.000000,99991.000000
mean,462.48475,1965.030150,1997-12-21 02:22:12.052589952,0.012600,91.372460,7.202390,425.530130,3.529860,1997-12-31 00:40:51.488619904,1988-02-09 00:43:11.369223296,...,0.017330,0.053170,0.049540,0.052450,0.194610,0.12730,0.21872,0.093980,0.018540,24145.029993
min,1.00000,1925.000000,1997-09-20 03:05:10,0.000000,0.000000,1.000000,1.000000,1.000000,1997-09-20 03:05:10,1922-01-01 00:00:00,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000,0.000000
25%,254.00000,1958.000000,1997-11-06 22:00:18,0.000000,47.000000,3.000000,175.000000,3.000000,1997-11-13 19:18:29.500000,1986-01-01 00:00:00,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000,23376.000000
50%,447.00000,1968.000000,1997-12-06 03:05:32,0.000000,77.000000,9.000000,322.000000,4.000000,1997-12-22 21:42:24,1994-01-01 00:00:00,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000,26298.000000
75%,682.00000,1974.000000,1998-02-14 02:52:00,0.000000,146.000000,11.000000,631.000000,4.000000,1998-02-23 18:53:04,1996-09-28 00:00:00,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000,27299.000000
max,943.00000,1991.000000,1998-04-22 23:02:29,1.000000,214.000000,12.000000,1682.000000,5.000000,1998-04-22 23:10:38,1998-10-23 00:00:00,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.00000,1.00000,1.000000,1.000000,28054.000000
std,266.61442,11.562623,NaN,0.111541,62.856015,4.205454,330.798356,1.125674,NaN,NaN,...,0.130498,0.224373,0.216994,0.222934,0.395902,0.33331,0.41338,0.291802,0.134894,5202.874377

In [54]:
df_full.columns

Index(['user_id', 'Full Name', 'year of birth', 'Gender', 'Occupation',
       'Active Since', 'Trabajador', 'Antiguedad', 'Horoscopo Activacion',
       'movie_id', 'rating', 'Date_rating', 'Name_movie', 'Release Date',
       'unknown', 'Action', 'Adventure', 'Animation', 'Children's', 'Comedy',
       'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror',
       'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western',
       'Antiguedad_pelicula'],
      dtype='object')

In [55]:
df_full.to_feather('../data/full_data.fth')

In [56]:
# %pip install pyarrow